CSI API ETABS v1
cAnalyze.SetRunCaseFlag Method
 Sets the run flag for load cases.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetRunCaseFlag(
	string Name,
	bool Run,
	bool All = false
)
Function SetRunCaseFlag (
	Name As String,
	Run As Boolean,
	Optional All As Boolean = false
) As Integer
Dim instance As cAnalyze
Dim Name As String
Dim Run As Boolean
Dim All As Boolean
Dim returnValue As Integer
returnValue = instance.SetRunCaseFlag(Name,
	Run, All)
int SetRunCaseFlag(
	String^ Name,
	bool Run,
	bool All = false
)
abstract SetRunCaseFlag :
        Name : string *
        Run : bool *
        ?All : bool
(* Defaults:
        let _All = defaultArg All false
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing load case that is to have its run flag set.
 This item is ignored when the All item is True.
Run
Type: System.Boolean
 If this item is True, the specified load case is to be run.
All (Optional)
Type: System.Boolean
 If this item is True, the run flag is set as specified by the Run item for all load cases, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the flag is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set load case run flag
       ret = SapModel.Analyze.SetRunCaseFlag("MODAL", False)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace